**ARQUIVO USADO PARA TESTARMOS E BRINCARMOS COM A BIBLIOTECA PANDAS

FUNÇÕES APRENDIDAS : SERIES (Para fácil entendimento, é uma tabela de banco de dados com apenas uma coluna e quantas linhas precisar)
                     DATAFRAME (Para fácil entendimento, nada mais nada menos do que uma tabela completa de banco de dados, podendo ser ótimo para leitura de informações provindas de datasets)

In [2]:
import pandas as pd
import numpy as np

In [4]:
serie_teste = pd.Series(np.random.random(10))

In [5]:
serie_teste

0    0.686298
1    0.976820
2    0.422032
3    0.836661
4    0.686899
5    0.399555
6    0.603694
7    0.940425
8    0.528754
9    0.942098
dtype: float64

In [6]:
serie_teste = pd.Series(np.random.random(3), index = ['random_1','random_2','random_3'])

In [7]:
serie_teste

random_1    0.212846
random_2    0.115352
random_3    0.699499
dtype: float64

In [12]:
dre_values = {'Receita_Bruta': 100000, 'Margem': 20, 'Receita_Liquida': 140000}
dre_ambev = pd.Series(dre_values)
dre_ambev

dre_values = {'Receita_Bruta': 102200, 'Margem': 25, 'Receita_Liquida': 120000}
dre_alb = pd.Series(dre_values)
dre_alb

Margem                 25
Receita_Bruta      102200
Receita_Liquida    120000
dtype: int64

In [31]:
dre_empresa = pd.DataFrame({'Ambev': dre_ambev, 'Air Liquide': dre_alb})
dre_empresa

                 Air Liquide   Ambev
Margem                    25      20
Receita_Bruta         102200  100000
Receita_Liquida       120000  140000

Podemos utilizar nas Series as funções que aprendemos em Numpy (Slice, Fancy Indexing, Masking), segue alguns exemplos abaixo:

In [20]:
serie_teste = pd.Series(np.random.random(10)) 
serie_teste[0:5]

0    0.550054
1    0.204893
2    0.339215
3    0.871581
4    0.022398
dtype: float64

In [21]:
serie_teste[(serie_teste > 0.10)]

0    0.550054
1    0.204893
2    0.339215
3    0.871581
5    0.430147
6    0.953771
7    0.601511
8    0.775511
9    0.318353
dtype: float64

In [22]:
serie_teste[[1,5]]

1    0.204893
5    0.430147
dtype: float64

Series.Loc: Usado para chamar a Serie pelo index nomeado, podendo utilizar Slices 
Series iLoc: Usado para chamar a Serie pelo index Python (0, 1, 2, 3 de acordo com a quantidade de valores)
Series iX: Usado para chamar a Serie pelo index tanto como o Loc quanto como iLoc. Terá melhor função nos DataFrame

In [23]:
serie_teste.loc[1]

0.20489316083772313

In [24]:
serie_teste.loc[1:3]

1    0.204893
2    0.339215
3    0.871581
dtype: float64

In [25]:
serie_teste.iloc[2]

0.33921525226945215

In [26]:
serie_teste.iloc[0]

0.550053519494428

In [29]:
serie_teste.ix[1]
               
#Podemos ver que a função ix foi depreciada

0.20489316083772313

Evite chamar as colunas do DataFrame pelo nome (dre['Ambev'] ao inves de dre.Ambev)

In [32]:
dre_empresa['Empresa'] = dre_empresa['Ambev'] + dre_empresa['Air Liquide']

In [33]:
dre_empresa

                 Air Liquide   Ambev  Empresa
Margem                    25      20       45
Receita_Bruta         102200  100000   202200
Receita_Liquida       120000  140000   260000

In [35]:
dre_empresa.T

#Troca colunas por linhas

             Margem  Receita_Bruta  Receita_Liquida
Air Liquide      25         102200           120000
Ambev            20         100000           140000
Empresa          45         202200           260000

In [36]:
dre_empresa.values

array([[    25,     20,     45],
       [102200, 100000, 202200],
       [120000, 140000, 260000]], dtype=int64)

In [38]:
dre_empresa.iloc[:2, :2]

               Air Liquide   Ambev
Margem                  25      20
Receita_Bruta       102200  100000

In [44]:
dre_empresa.ix[0,1]

c:\users\avell 1555 iron\appdata\local\programs\python\python36-32\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

20

In [46]:
dre_empresa.loc[:'Receita_Bruta', :'Ambev']

               Air Liquide   Ambev
Margem                  25      20
Receita_Bruta       102200  100000

In [47]:
dre_empresa.ix[:1, :'Ambev']

        Air Liquide  Ambev
Margem           25     20

In [50]:
dre_empresa.loc[dre_empresa.Ambev > 20, :'Empresa']

                 Air Liquide   Ambev  Empresa
Receita_Bruta         102200  100000   202200
Receita_Liquida       120000  140000   260000

Vamos utilizar Ufuncs para vermos de uma maneira melhor a relacao entre NumPy e Pandas

In [51]:
rng = np.random.RandomState(42)
ser = pd.Series(rng.randint(0,10,4))
ser

0    6
1    3
2    7
3    4
dtype: int32

In [52]:
df = pd.DataFrame(rng.randint(0,10,(3,4)), columns = ['A','B','C','D'])

In [53]:
df

   A  B  C  D
0  6  9  2  6
1  7  4  3  7
2  7  2  5  4

In [54]:
np.exp(ser)

0     403.428793
1      20.085537
2    1096.633158
3      54.598150
dtype: float64

In [56]:
np.sin(df * np.pi/4)

          A             B         C             D
0 -1.000000  7.071068e-01  1.000000 -1.000000e+00
1 -0.707107  1.224647e-16  0.707107 -7.071068e-01
2 -0.707107  1.000000e+00 -0.707107  1.224647e-16

Para operações binárias em Series e DataFrame, o Pandas alinha os indices para que as estruturas se conversem, o que torna interessante quando tempos valores incompletos

In [58]:
margem = pd.Series({'Ambev':20, 'Air Liquide': 10, 'Empresa': 5}, name = 'Margem')

In [59]:
receita_bruta = pd.Series({'Ambev':100000, 'Air Liquide': 50000, 'Empresa': 150000}, name = 'ReceitaBruta')

In [60]:
receita_bruta/margem

Air Liquide     5000.0
Ambev           5000.0
Empresa        30000.0
dtype: float64

In [61]:
A = pd.Series([2,4,6], index = [0,1,2])

In [62]:
B = pd.Series([1,3,5], index = [1,2,3])

In [63]:
A + B

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [64]:
A.add(B, fill_value = 0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

In [65]:
A = pd.DataFrame(rng.randint(0, 20, (2,2)), columns=list('AB'))

In [66]:
B = pd.DataFrame(rng.randint(0,10, (3,3)), columns=list('ABC'))

In [67]:
A + B

      A     B   C
0   5.0  11.0 NaN
1  10.0   9.0 NaN
2   NaN   NaN NaN

In [68]:
A.stack()

0  A     1
   B    11
1  A     5
   B     1
dtype: int32

In [71]:
fill = A.stack().mean()

In [72]:
A.add(B, fill_value=fill)

      A     B     C
0   5.0  11.0  13.5
1  10.0   9.0   4.5
2  13.5   6.5  10.5

Para representarmos valores faltantes, podemos utilizar None em caso de dtype = object, e NaN nos demais casos. Porém, o NaN em NumPy causa dano aos valores, tendo que utilizar funções iniciadas com nan (nansum, nanmin, nanmax) para ignorar o valor NaN.

Em Pandas, podemos utilizar None e NaN juntos, porém, ao executar o código, ambos sempre viram NaN

In [4]:
import pandas as pd
import numpy as np
data = pd.Series([1, np.nan, 'hello', None])

#Função isnull() verifica o que está nulo nos dados

In [3]:
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [5]:
data[data.notnull()]

0        1
2    hello
dtype: object

In [7]:
data[data.isnull()]

1     NaN
3    None
dtype: object

In [9]:
#Função dropna() irá remover todos os valores ausentes nos dados
data.dropna()

0        1
2    hello
dtype: object

In [12]:
df = pd.DataFrame([[1, np.nan, 2], [2, 3, 5], [np.nan, 4, 6]])

In [13]:
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [15]:
df.dropna()

#No dataframe, o uso de dropna irá remover todas as linhas (por default) que possuírem valor ausente

     0    1  2
1  2.0  3.0  5

In [16]:
df.dropna(axis='columns')

   2
0  2
1  5
2  6

In [18]:
df[3] = np.nan

In [20]:
df.dropna(axis = 'columns', how = 'all')

#Utilizando o how, definimos se ele irá dropar as colunas com todos os valores da coluna estando ausentes

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [21]:
df.dropna(axis = 'columns', how = 'any')

#Utilizando any, ele irá excluir todas colunas que tiverem pelo menos um valor nulo

   2
0  2
1  5
2  6

In [22]:
df.dropna(axis='rows', thresh=3)

#Função thresh permite que você estabeleça quantos valores nulos deve ter para ser excluído

     0    1  2   3
1  2.0  3.0  5 NaN

Com a função fillna(), podemos definir qual valor queremos utilizar para preencher os valores ausentes

In [23]:
data = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))

In [24]:
data.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

In [26]:
data.fillna(method='ffill')

#Utiliza o próximo valor da série para preencher o valor nulo

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [27]:
df.fillna(method='ffill', axis=1)

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0

É possível em Python criar série multiplamente indexadas, como é apresentado abaixo:

In [39]:
index = [('Ambev', 2016), ('Ambev', 2017), ('Air Liquide', 2015), ('Air Liquide', 2017),  ('Unilever', 2017), ]

In [40]:
values = [1000000, 200000, 20232, 150000, 100000]

In [53]:
sample = pd.Series(values, index=index)

In [54]:
sample

(Ambev, 2016)          1000000
(Ambev, 2017)           200000
(Air Liquide, 2015)      20232
(Air Liquide, 2017)     150000
(Unilever, 2017)        100000
dtype: int64

In [55]:
sample[('Ambev', 2016):('Ambev', 2017)]

(Ambev, 2016)    1000000
(Ambev, 2017)     200000
dtype: int64

In [56]:
sample[[i for i in sample.index if i[1] == 2017]]

#Função para poder pegar apenas valores com parte do index sendo 2017, feita de maneira complicada devido a pouco suporte para esse tipo de análise

(Ambev, 2017)          200000
(Air Liquide, 2017)    150000
(Unilever, 2017)       100000
dtype: int64

Para melhor lidar com os multi index, temos a função Multindex do Pandas que nos fornece várias maneiras de lidar com esses valores

In [57]:
index = pd.MultiIndex.from_tuples(index)
index

MultiIndex(levels=[['Air Liquide', 'Ambev', 'Unilever'], [2015, 2016, 2017]],
           labels=[[1, 1, 0, 0, 2], [1, 2, 0, 2, 2]])

In [58]:
sample = sample.reindex(index)

In [59]:
sample

Ambev        2016    1000000
             2017     200000
Air Liquide  2015      20232
             2017     150000
Unilever     2017     100000
dtype: int64

In [60]:
sample[:, 2017]

Ambev          200000
Air Liquide    150000
Unilever       100000
dtype: int64

Caso quisermos, podemos usar a função unstack() para converter uma Série multi indexada em um DataFrame

In [61]:
sample_df = sample.unstack()

In [62]:
sample_df

                2015       2016      2017
Air Liquide  20232.0        NaN  150000.0
Ambev            NaN  1000000.0  200000.0
Unilever         NaN        NaN  100000.0

In [63]:
sample_df.stack()

Air Liquide  2015      20232.0
             2017     150000.0
Ambev        2016    1000000.0
             2017     200000.0
Unilever     2017     100000.0
dtype: float64

In [64]:
sample_df = pd.DataFrame({'total': sample, 'margem': [ 10000, 200000, 30213, 24232, 12222]})

In [65]:
sample_df

                  margem    total
Ambev       2016   10000  1000000
            2017  200000   200000
Air Liquide 2015   30213    20232
            2017   24232   150000
Unilever    2017   12222   100000

In [66]:
df = pd.DataFrame(np.random.rand(4,2), index=[['a','a','b','b'], [1,2,1,2]], columns=['data1','data2'])

In [67]:
df

        data1     data2
a 1  0.233426  0.415009
  2  0.178500  0.168378
b 1  0.137208  0.366771
  2  0.840881  0.499333

In [68]:
sample.index.names = ['cdc', 'ano']

In [69]:
sample

cdc          ano
Ambev        2016    1000000
             2017     200000
Air Liquide  2015      20232
             2017     150000
Unilever     2017     100000
dtype: int64

Nos DataFrame, as linhas e colunas são completamente simétricas, mas podemos criar vários levels de colunas e linhas

In [83]:
index = pd.MultiIndex.from_product([[2016,2017], [1,2]], names = ['Ano','Quinzena'])

In [84]:
columns = pd.MultiIndex.from_product([['Ambev','Air Liquide','Unilever',], ['Receita Bruta','Margem',]], names = ['subject','type'])

In [85]:
data = np.round(np.random.randn(4,6),1)

In [86]:
data[:,::2] *= 10
data += 37

In [87]:
health_data = pd.DataFrame(data, index=index, columns=columns)

In [89]:
health_data

#O resultado ira prduzir uma visao de 4 dimensoes, o que nos leva a possibilidades de utilizacao do python em conceitos OLAP

subject               Ambev          Air Liquide             Unilever
type          Receita Bruta Margem Receita Bruta Margem Receita Bruta Margem
Ano  Quinzena
2016 1                 36.0   36.2          20.0   37.6          28.0   36.1
     2                 45.0   37.5          43.0   37.5          29.0   38.5
2017 1                 46.0   36.7          43.0   35.7          38.0   35.9
     2                 29.0   36.7          51.0   35.9          50.0   34.9

In [92]:
health_data['Ambev','Receita Bruta']

Ano   Quinzena
2016  1           36.0
      2           45.0
2017  1           46.0
      2           29.0
Name: (Ambev, Receita Bruta), dtype: float64

In [93]:
sample.loc['Ambev']

ano
2016    1000000
2017     200000
dtype: int64

In [95]:
sample.loc['Ambev']

ano
2016    1000000
2017     200000
dtype: int64

In [96]:
sample[sample > 100000]

cdc          ano
Ambev        2016    1000000
             2017     200000
Air Liquide  2017     150000
dtype: int64

In [98]:
idx = pd.IndexSlice
health_data.loc[idx[:,1], idx[:, 'Margem']]

subject        Ambev Air Liquide Unilever
type          Margem      Margem   Margem
Ano  Quinzena
2016 1          36.2        37.6     36.1
2017 1          36.7        35.7     35.9

In [100]:
health_data.loc[idx[:,2], idx[:, 'Margem']]

subject        Ambev Air Liquide Unilever
type          Margem      Margem   Margem
Ano  Quinzena
2016 2          37.5        37.5     38.5
2017 2          36.7        35.9     34.9

In [101]:
#A maioria das operações de slicing dos MultiIndex irá falhar caso os index não estejam ordenados

index = pd.MultiIndex.from_product([['a','c','b'], [1,2]])

In [102]:
data = pd.Series(np.random.rand(6), index=index)

In [104]:
data.index.names = ['char', 'int']

In [105]:
data

char  int
a     1      0.142539
      2      0.437244
c     1      0.716421
      2      0.335660
b     1      0.235878
      2      0.489225
dtype: float64

In [107]:
data = data.sort_index()

In [108]:
data

char  int
a     1      0.142539
      2      0.437244
b     1      0.235878
      2      0.489225
c     1      0.716421
      2      0.335660
dtype: float64

In [111]:
sample.unstack(level=0)

cdc   Air Liquide      Ambev  Unilever
ano
2015      20232.0        NaN       NaN
2016          NaN  1000000.0       NaN
2017     150000.0   200000.0  100000.0

In [112]:
sample.unstack()

ano             2015       2016      2017
cdc
Air Liquide  20232.0        NaN  150000.0
Ambev            NaN  1000000.0  200000.0
Unilever         NaN        NaN  100000.0

In [113]:
sample.unstack(level=1)

ano             2015       2016      2017
cdc
Air Liquide  20232.0        NaN  150000.0
Ambev            NaN  1000000.0  200000.0
Unilever         NaN        NaN  100000.0

In [114]:
sample

cdc          ano
Ambev        2016    1000000
             2017     200000
Air Liquide  2015      20232
             2017     150000
Unilever     2017     100000
dtype: int64

In [116]:
sample_flat = sample.reset_index(name='valores')

In [117]:
sample_flat

# Utilizando o reset_index, damos nome a coluna que possui os valores na Série com Multiindex, transformando num dataframe

           cdc   ano  valores
0        Ambev  2016  1000000
1        Ambev  2017   200000
2  Air Liquide  2015    20232
3  Air Liquide  2017   150000
4     Unilever  2017   100000

In [119]:
sample_flat.set_index(['cdc','ano'])

#Utilizando o set_index transformamos alguns valores em Multiindex, para que a informação fique correta

                  valores
cdc         ano
Ambev       2016  1000000
            2017   200000
Air Liquide 2015    20232
            2017   150000
Unilever    2017   100000

In [120]:
health_data

subject               Ambev          Air Liquide             Unilever
type          Receita Bruta Margem Receita Bruta Margem Receita Bruta Margem
Ano  Quinzena
2016 1                 36.0   36.2          20.0   37.6          28.0   36.1
     2                 45.0   37.5          43.0   37.5          29.0   38.5
2017 1                 46.0   36.7          43.0   35.7          38.0   35.9
     2                 29.0   36.7          51.0   35.9          50.0   34.9

In [121]:
data_mean = health_data.mean(level='Ano')

In [122]:
data_mean

subject         Ambev          Air Liquide             Unilever
type    Receita Bruta Margem Receita Bruta Margem Receita Bruta Margem
Ano
2016             40.5  36.85          31.5  37.55          28.5   37.3
2017             37.5  36.70          47.0  35.80          44.0   35.4

In [124]:
data_mean.mean(axis=1, level='type')

#Essa função funciona como um GroupBy no select, agregando os valores de todos os Centros de Custo e calculando a média da marge
# e da receita bruta por ano

type  Receita Bruta     Margem
Ano
2016      33.500000  37.233333
2017      42.833333  35.966667

In [125]:
def make_df(cols, ind):
        """Quickly make a DataFrame"""
        data = {c: [str(c) + str(i) for i in ind] for c in cols}
        return pd.DataFrame(data,ind)

In [126]:
make_df('ABC',range(3))

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [15]:
class display(object):
    template = """<div style="float: left; padding: 10px;">
    <p style='font-family:"Courier New", Courier, monospace'>{0}</p>{1}
    </div>"""
    def __init__(self, *args):
        self.args = args
        
    def _repr_html_(self):
        return '\n'.join(self.template.format(a, eval(a)._repr_html_()) for a in self.args)
    
    def __repr__(self):
        return '\n\n'.join(a + '\n' + repr(eval(a)) for a in self.args)

In [129]:
ser1 = pd.Series(['A', 'B', 'C'], index=[1,2,3])
ser2 = pd.Series(['D','E','F'], index=[4,5,6])

In [130]:
pd.concat([ser1,ser2])

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

In [131]:
df1 = make_df('AB', [1,2])

In [132]:
df2 = make_df('AB',[3,4])

In [133]:
df1

    A   B
1  A1  B1
2  A2  B2

In [134]:
df2

    A   B
3  A3  B3
4  A4  B4

In [135]:
display('df1','df2','pd.concat([df1,df2])')

df1
    A   B
1  A1  B1
2  A2  B2

df2
    A   B
3  A3  B3
4  A4  B4

pd.concat([df1,df2])
    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [139]:
df3 = make_df('AB',[0,1])
df4 = make_df('CD', [0,1])
display('df3','df4',"pd.concat([df3,df4])")

df3
    A   B
0  A0  B0
1  A1  B1

df4
    C   D
0  C0  D0
1  C1  D1

pd.concat([df3,df4])
     A    B    C    D
0   A0   B0  NaN  NaN
1   A1   B1  NaN  NaN
0  NaN  NaN   C0   D0
1  NaN  NaN   C1   D1

In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'], 'rank' : [1,2,3,4]})

In [5]:
df2 = pd.DataFrame({'name' : ['Bob', 'Jake', 'Lisa', 'Sue'], 'rank' : [3, 1, 4, 2]})

In [7]:
pd.merge(df1,df2, on = 'name')

   name  rank_x  rank_y
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

In [8]:
pd.merge(df1,df2, on = 'name', suffixes=['_1', '_2'])

   name  rank_1  rank_2
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

Como ambas as colunas possuem o mesmo nome, o merge não trás nenhuma junção correta. É necessário utilizar o on = (coluna a ser juntada) para poder realizar o merge

In [11]:
pop = pd.read_csv('data_state.csv')

In [12]:
areas = pd.read_csv('state_areas.csv')

In [13]:
abbrevs = pd.read_csv('state_abbreves.csv')

In [16]:
display('pop.head()','areas.head()','abbrevs.head()')

pop.head()
  state/region     ages  year  population
0           AL  under18  2012   1117489.0
1           AL    total  2012   4817528.0
2           AL  under18  2010   1130966.0
3           AL    total  2010   4785570.0
4           AL  under18  2011   1125763.0

areas.head()
        state  area (sq. mi)
0     Alabama          52423
1      Alaska         656425
2     Arizona         114006
3    Arkansas          53182
4  California         163707

abbrevs.head()
        state abbreviation
0     Alabama           AL
1      Alaska           AK
2     Arizona           AZ
3    Arkansas           AR
4  California           CA

In [23]:
merged = pd.merge(pop, abbrevs, how="outer", left_on='state/region', right_on='abbreviation')
merged2 = pd.merge(pop, abbrevs, how="inner", left_on='state/region', right_on='abbreviation')

In [25]:
merged = merged.drop('abbreviation',1) #drop duplicate info

In [27]:
merged.head()

  state/region     ages  year  population    state
0           AL  under18  2012   1117489.0  Alabama
1           AL    total  2012   4817528.0  Alabama
2           AL  under18  2010   1130966.0  Alabama
3           AL    total  2010   4785570.0  Alabama
4           AL  under18  2011   1125763.0  Alabama

In [29]:
merged.isnull().any() #check if the merged have any null information

state/region    False
ages            False
year            False
population       True
state            True
dtype: bool

In [31]:
merged[merged['population'].isnull()].head()

     state/region     ages  year  population state
2448           PR  under18  1990         NaN   NaN
2449           PR    total  1990         NaN   NaN
2450           PR    total  1991         NaN   NaN
2451           PR  under18  1991         NaN   NaN
2452           PR    total  1993         NaN   NaN

In [32]:
merged.loc[merged['state'].isnull(), 'state/region'].unique()

array(['PR', 'USA'], dtype=object)

In [42]:
merged.loc[merged['state/region'] == 'PR', 'state'] = 'Puerto Rico'

In [43]:
merged.loc[merged['state/region'] == 'USA', 'state'] = 'United States'

In [44]:
merged.isnull().any()

state/region    False
ages            False
year            False
population       True
state           False
dtype: bool

In [45]:
final = pd.merge(merged, areas, on = 'state', how = 'left')

In [46]:
final.head()

  state/region     ages  year  population    state  area (sq. mi)
0           AL  under18  2012   1117489.0  Alabama        52423.0
1           AL    total  2012   4817528.0  Alabama        52423.0
2           AL  under18  2010   1130966.0  Alabama        52423.0
3           AL    total  2010   4785570.0  Alabama        52423.0
4           AL  under18  2011   1125763.0  Alabama        52423.0

In [47]:
final.isnull().any()

state/region     False
ages             False
year             False
population        True
state            False
area (sq. mi)     True
dtype: bool

In [48]:
final['state'][final['area (sq. mi)'].isnull()].unique()

array(['United States'], dtype=object)

In [49]:
final.dropna(inplace=True)
final.head()

  state/region     ages  year  population    state  area (sq. mi)
0           AL  under18  2012   1117489.0  Alabama        52423.0
1           AL    total  2012   4817528.0  Alabama        52423.0
2           AL  under18  2010   1130966.0  Alabama        52423.0
3           AL    total  2010   4785570.0  Alabama        52423.0
4           AL  under18  2011   1125763.0  Alabama        52423.0

In [50]:
data2010 = final.query("year == 2010 & ages == 'total'")

In [51]:
data2010.head()

    state/region   ages  year  population       state  area (sq. mi)
3             AL  total  2010   4785570.0     Alabama        52423.0
91            AK  total  2010    713868.0      Alaska       656425.0
101           AZ  total  2010   6408790.0     Arizona       114006.0
189           AR  total  2010   2922280.0    Arkansas        53182.0
197           CA  total  2010  37333601.0  California       163707.0

In [52]:
data2010.set_index('state', inplace=True) #When inplace is true, the data is rename in place

In [53]:
data2010

                     state/region   ages  year  population  area (sq. mi)
state
Alabama                        AL  total  2010   4785570.0        52423.0
Alaska                         AK  total  2010    713868.0       656425.0
Arizona                        AZ  total  2010   6408790.0       114006.0
Arkansas                       AR  total  2010   2922280.0        53182.0
California                     CA  total  2010  37333601.0       163707.0
Colorado                       CO  total  2010   5048196.0       104100.0
Connecticut                    CT  total  2010   3579210.0         5544.0
Delaware                       DE  total  2010    899711.0         1954.0
District of Columbia           DC  total  2010    605125.0           68.0
Florida                        FL  total  2010  18846054.0        65758.0
Georgia                        GA  total  2010   9713248.0        59441.0
Hawaii                         HI  total  2010   1363731.0        10932.0
Idaho                          ID  total  2010   1570718.0        83574.0
Illinois                       IL  total  2010  12839695.0        57918.0
Indiana                        IN  total  2010   6489965.0        36420.0
Iowa                           IA  total  2010   3050314.0        56276.0
Kansas                         KS  total  2010   2858910.0        82282.0
Kentucky                       KY  total  2010   4347698.0        40411.0
Louisiana                      LA  total  2010   4545392.0        51843.0
Maine                          ME  total  2010   1327366.0        35387.0
Maryland                       MD  total  2010   5787193.0        12407.0
Massachusetts                  MA  total  2010   6563263.0        10555.0
Michigan                       MI  total  2010   9876149.0        96810.0
Minnesota                      MN  total  2010   5310337.0        86943.0
Mississippi                    MS  total  2010   2970047.0        48434.0
Missouri                       MO  total  2010   5996063.0        69709.0
Montana                        MT  total  2010    990527.0       147046.0
Nebraska                       NE  total  2010   1829838.0        77358.0
Nevada                         NV  total  2010   2703230.0       110567.0
New Hampshire                  NH  total  2010   1316614.0         9351.0
New Jersey                     NJ  total  2010   8802707.0         8722.0
New Mexico                     NM  total  2010   2064982.0       121593.0
New York                       NY  total  2010  19398228.0        54475.0
North Carolina                 NC  total  2010   9559533.0        53821.0
North Dakota                   ND  total  2010    674344.0        70704.0
Ohio                           OH  total  2010  11545435.0        44828.0
Oklahoma                       OK  total  2010   3759263.0        69903.0
Oregon                         OR  total  2010   3837208.0        98386.0
Pennsylvania                   PA  total  2010  12710472.0        46058.0
Rhode Island                   RI  total  2010   1052669.0         1545.0
South Carolina                 SC  total  2010   4636361.0        32007.0
South Dakota                   SD  total  2010    816211.0        77121.0
Tennessee                      TN  total  2010   6356683.0        42146.0
Texas                          TX  total  2010  25245178.0       268601.0
Utah                           UT  total  2010   2774424.0        84904.0
Vermont                        VT  total  2010    625793.0         9615.0
Virginia                       VA  total  2010   8024417.0        42769.0
Washington                     WA  total  2010   6742256.0        71303.0
West Virginia                  WV  total  2010   1854146.0        24231.0
Wisconsin                      WI  total  2010   5689060.0        65503.0
Wyoming                        WY  total  2010    564222.0        97818.0
Puerto Rico                    PR  total  2010   3721208.0         3515.0

In [54]:
density = data2010['population']/data2010['area (sq. mi)']

In [56]:
density

state
Alabama                   91.287603
Alaska                     1.087509
Arizona                   56.214497
Arkansas                  54.948667
California               228.051342
Colorado                  48.493718
Connecticut              645.600649
Delaware                 460.445752
District of Columbia    8898.897059
Florida                  286.597129
Georgia                  163.409902
Hawaii                   124.746707
Idaho                     18.794338
Illinois                 221.687472
Indiana                  178.197831
Iowa                      54.202751
Kansas                    34.745266
Kentucky                 107.586994
Louisiana                 87.676099
Maine                     37.509990
Maryland                 466.445797
Massachusetts            621.815538
Michigan                 102.015794
Minnesota                 61.078373
Mississippi               61.321530
Missouri                  86.015622
Montana                    6.736171
Nebraska                  23.654153
Nevada                    24.448796
New Hampshire            140.799273
New Jersey              1009.253268
New Mexico                16.982737
New York                 356.094135
North Carolina           177.617157
North Dakota               9.537565
Ohio                     257.549634
Oklahoma                  53.778278
Oregon                    39.001565
Pennsylvania             275.966651
Rhode Island             681.339159
South Carolina           144.854594
South Dakota              10.583512
Tennessee                150.825298
Texas                     93.987655
Utah                      32.677188
Vermont                   65.085075
Virginia                 187.622273
Washington                94.557817
West Virginia             76.519582
Wisconsin                 86.851900
Wyoming                    5.768079
Puerto Rico             1058.665149
dtype: float64

In [59]:
import matplotlib as mpl

In [62]:
import numpy as np

In [63]:
rng = np.random.RandomState(42)
ser = pd.Series(rng.rand(5))
ser

0    0.374540
1    0.950714
2    0.731994
3    0.598658
4    0.156019
dtype: float64

In [64]:
ser.sum()

2.811925491708157

In [65]:
ser.mean()

0.5623850983416314

In [66]:
df = pd.DataFrame({'A' : rng.rand(5), 'B': rng.rand(5)})

In [67]:
df

          A         B
0  0.155995  0.020584
1  0.058084  0.969910
2  0.866176  0.832443
3  0.601115  0.212339
4  0.708073  0.181825

In [68]:
df.mean()

A    0.477888
B    0.443420
dtype: float64

In [69]:
df.mean(axis='columns')

0    0.088290
1    0.513997
2    0.849309
3    0.406727
4    0.444949
dtype: float64

In [72]:
data2010.describe() #realiza vários tipos de contas em cima dos dados de cada coluna, isso permite um overview sobre o dado

         year    population  area (sq. mi)
count    52.0  5.200000e+01      52.000000
mean   2010.0  6.020144e+06   72892.288462
std       0.0  6.779836e+06   95415.854873
min    2010.0  5.642220e+05      68.000000
25%    2010.0  1.765058e+06   34542.000000
50%    2010.0  4.092453e+06   55375.500000
75%    2010.0  6.608011e+06   83906.500000
max    2010.0  3.733360e+07  656425.000000

In [75]:
df = pd.DataFrame({'key':['A','B','C','A','B','C'], 'data' : range(6)}, columns =['key','data'])

In [76]:
df

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

In [77]:
df.groupby('key')

In [78]:
df.groupby('key').sum()

     data
key
A       3
B       5
C       7

In [82]:
data2010.groupby('state')

In [84]:
data2010.groupby('state')['population'].mean()

state
Alabama                  4785570.0
Alaska                    713868.0
Arizona                  6408790.0
Arkansas                 2922280.0
California              37333601.0
Colorado                 5048196.0
Connecticut              3579210.0
Delaware                  899711.0
District of Columbia      605125.0
Florida                 18846054.0
Georgia                  9713248.0
Hawaii                   1363731.0
Idaho                    1570718.0
Illinois                12839695.0
Indiana                  6489965.0
Iowa                     3050314.0
Kansas                   2858910.0
Kentucky                 4347698.0
Louisiana                4545392.0
Maine                    1327366.0
Maryland                 5787193.0
Massachusetts            6563263.0
Michigan                 9876149.0
Minnesota                5310337.0
Mississippi              2970047.0
Missouri                 5996063.0
Montana                   990527.0
Nebraska                 1829838.0
Nevada                   2703230.0
New Hampshire            1316614.0
New Jersey               8802707.0
New Mexico               2064982.0
New York                19398228.0
North Carolina           9559533.0
North Dakota              674344.0
Ohio                    11545435.0
Oklahoma                 3759263.0
Oregon                   3837208.0
Pennsylvania            12710472.0
Puerto Rico              3721208.0
Rhode Island             1052669.0
South Carolina           4636361.0
South Dakota              816211.0
Tennessee                6356683.0
Texas                   25245178.0
Utah                     2774424.0
Vermont                   625793.0
Virginia                 8024417.0
Washington               6742256.0
West Virginia            1854146.0
Wisconsin                5689060.0
Wyoming                   564222.0
Name: population, dtype: float64

In [85]:
for(state, group) in data2010.groupby('state'):
    print("{0:30s} shape={1}".format(state,group.shape))

Alabama                        shape=(1, 5)
Alaska                         shape=(1, 5)
Arizona                        shape=(1, 5)
Arkansas                       shape=(1, 5)
California                     shape=(1, 5)
Colorado                       shape=(1, 5)
Connecticut                    shape=(1, 5)
Delaware                       shape=(1, 5)
District of Columbia           shape=(1, 5)
Florida                        shape=(1, 5)
Georgia                        shape=(1, 5)
Hawaii                         shape=(1, 5)
Idaho                          shape=(1, 5)
Illinois                       shape=(1, 5)
Indiana                        shape=(1, 5)
Iowa                           shape=(1, 5)
Kansas                         shape=(1, 5)
Kentucky                       shape=(1, 5)
Louisiana                      shape=(1, 5)
Maine                          shape=(1, 5)
Maryland                       shape=(1, 5)
Massachusetts                  shape=(1, 5)
Michigan                       shape=(1, 5)
Minnesota                      shape=(1, 5)
Mississippi                    shape=(1, 5)
Missouri                       shape=(1, 5)
Montana                        shape=(1, 5)
Nebraska                       shape=(1, 5)
Nevada                         shape=(1, 5)
New Hampshire                  shape=(1, 5)
New Jersey                     shape=(1, 5)
New Mexico                     shape=(1, 5)
New York                       shape=(1, 5)
North Carolina                 shape=(1, 5)
North Dakota                   shape=(1, 5)
Ohio                           shape=(1, 5)
Oklahoma                       shape=(1, 5)
Oregon                         shape=(1, 5)
Pennsylvania                   shape=(1, 5)
Puerto Rico                    shape=(1, 5)
Rhode Island                   shape=(1, 5)
South Carolina                 shape=(1, 5)
South Dakota                   shape=(1, 5)
Tennessee                      shape=(1, 5)
Texas                          shape=(1, 5)
Utah                           shape=(1, 5)
Vermont                        shape=(1, 5)
Virginia                       shape=(1, 5)
Washington                     shape=(1, 5)
West Virginia                  shape=(1, 5)
Wisconsin                      shape=(1, 5)
Wyoming                        shape=(1, 5)

In [87]:
data2010.groupby('state')['population'].describe()

,count,mean,std,min,25%,50%,75%,max
state,,,,,,,,
Alabama,1.0,4785570.0,NaN,4785570.0,4785570.0,4785570.0,4785570.0,4785570.0
Alaska,1.0,713868.0,NaN,713868.0,713868.0,713868.0,713868.0,713868.0
Arizona,1.0,6408790.0,NaN,6408790.0,6408790.0,6408790.0,6408790.0,6408790.0
Arkansas,1.0,2922280.0,NaN,2922280.0,2922280.0,2922280.0,2922280.0,2922280.0
California,1.0,37333601.0,NaN,37333601.0,37333601.0,37333601.0,37333601.0,37333601.0
Colorado,1.0,5048196.0,NaN,5048196.0,5048196.0,5048196.0,5048196.0,5048196.0
Connecticut,1.0,3579210.0,NaN,3579210.0,3579210.0,3579210.0,3579210.0,3579210.0
Delaware,1.0,899711.0,NaN,899711.0,899711.0,899711.0,899711.0,899711.0
District of Columbia,1.0,605125.0,NaN,605125.0,605125.0,605125.0,605125.0,605125.0
Florida,1.0,18846054.0,NaN,18846054.0,18846054.0,18846054.0,18846054.0,18846054.0
Georgia,1.0,9713248.0,NaN,9713248.0,9713248.0,9713248.0,9713248.0,9713248.0
Hawaii,1.0,1363731.0,NaN,1363731.0,1363731.0,1363731.0,1363731.0,1363731.0
Idaho,1.0,1570718.0,NaN,1570718.0,1570718.0,1570718.0,1570718.0,1570718.0
Illinois,1.0,12839695.0,NaN,12839695.0,12839695.0,12839695.0,12839695.0,12839695.0
Indiana,1.0,6489965.0,NaN,6489965.0,6489965.0,6489965.0,6489965.0,6489965.0
Iowa,1.0,3050314.0,NaN,3050314.0,3050314.0,3050314.0,3050314.0,3050314.0
Kansas,1.0,2858910.0,NaN,2858910.0,2858910.0,2858910.0,2858910.0,2858910.0
Kentucky,1.0,4347698.0,NaN,4347698.0,4347698.0,4347698.0,4347698.0,4347698.0
Louisiana,1.0,4545392.0,NaN,4545392.0,4545392.0,4545392.0,4545392.0,4545392.0
Maine,1.0,1327366.0,NaN,1327366.0,1327366.0,1327366.0,1327366.0,1327366.0
Maryland,1.0,5787193.0,NaN,5787193.0,5787193.0,5787193.0,5787193.0,5787193.0
Massachusetts,1.0,6563263.0,NaN,6563263.0,6563263.0,6563263.0,6563263.0,6563263.0
Michigan,1.0,9876149.0,NaN,9876149.0,9876149.0,9876149.0,9876149.0,9876149.0
Minnesota,1.0,5310337.0,NaN,5310337.0,5310337.0,5310337.0,5310337.0,5310337.0
Mississippi,1.0,2970047.0,NaN,2970047.0,2970047.0,2970047.0,2970047.0,2970047.0
Missouri,1.0,5996063.0,NaN,5996063.0,5996063.0,5996063.0,5996063.0,5996063.0
Montana,1.0,990527.0,NaN,990527.0,990527.0,990527.0,990527.0,990527.0
Nebraska,1.0,1829838.0,NaN,1829838.0,1829838.0,1829838.0,1829838.0,1829838.0
Nevada,1.0,2703230.0,NaN,2703230.0,2703230.0,2703230.0,2703230.0,2703230.0
New Hampshire,1.0,1316614.0,NaN,1316614.0,1316614.0,1316614.0,1316614.0,1316614.0
New Jersey,1.0,8802707.0,NaN,8802707.0,8802707.0,8802707.0,8802707.0,8802707.0
New Mexico,1.0,2064982.0,NaN,2064982.0,2064982.0,2064982.0,2064982.0,2064982.0
New York,1.0,19398228.0,NaN,19398228.0,19398228.0,19398228.0,19398228.0,19398228.0
North Carolina,1.0,9559533.0,NaN,9559533.0,9559533.0,9559533.0,9559533.0,9559533.0
North Dakota,1.0,674344.0,NaN,674344.0,674344.0,674344.0,674344.0,674344.0
Ohio,1.0,11545435.0,NaN,11545435.0,11545435.0,11545435.0,11545435.0,11545435.0
Oklahoma,1.0,3759263.0,NaN,3759263.0,3759263.0,3759263.0,3759263.0,3759263.0
Oregon,1.0,3837208.0,NaN,3837208.0,3837208.0,3837208.0,3837208.0,3837208.0
Pennsylvania,1.0,12710472.0,NaN,12710472.0,12710472.0,12710472.0,12710472.0,12710472.0
Puerto Rico,1.0,3721208.0,NaN,3721208.0,3721208.0,3721208.0,3721208.0,3721208.0
Rhode Island,1.0,1052669.0,NaN,1052669.0,1052669.0,1052669.0,1052669.0,1052669.0
South Carolina,1.0,4636361.0,NaN,4636361.0,4636361.0,4636361.0,4636361.0,4636361.0
South Dakota,1.0,816211.0,NaN,816211.0,816211.0,816211.0,816211.0,816211.0
Tennessee,1.0,6356683.0,NaN,6356683.0,6356683.0,6356683.0,6356683.0,6356683.0
Texas,1.0,25245178.0,NaN,25245178.0,25245178.0,25245178.0,25245178.0,25245178.0
Utah,1.0,2774424.0,NaN,2774424.0,2774424.0,2774424.0,2774424.0,2774424.0
Vermont,1.0,625793.0,NaN,625793.0,625793.0,625793.0,625793.0,625793.0
Virginia,1.0,8024417.0,NaN,8024417.0,8024417.0,8024417.0,8024417.0,8024417.0
Washington,1.0,6742256.0,NaN,6742256.0,6742256.0,6742256.0,6742256.0,6742256.0
West Virginia,1.0,1854146.0,NaN,1854146.0,1854146.0,1854146.0,1854146.0,1854146.0
Wisconsin,1.0,5689060.0,NaN,5689060.0,5689060.0,5689060.0,5689060.0,5689060.0
Wyoming,1.0,564222.0,NaN,564222.0,564222.0,564222.0,564222.0,564222.0

In [88]:
df.groupby('key').aggregate(['min', np.median, max])

    data
     min median max
key
A      0    1.5   3
B      1    2.5   4
C      2    3.5   5

In [91]:
df['data']

0    0
1    1
2    2
3    3
4    4
5    5
Name: data, dtype: int64

In [92]:
dataNova = 10 * (data2010['population'] // 10)

In [94]:
dataNova = dataNova.astype(str) + 's'

In [95]:
dataNova.name = 'population_new'

In [97]:
data2010.groupby(['state',dataNova])['ages'].sum().unstack().fillna(0)

population_new,1052660.0s,11545430.0s,12710470.0s,12839690.0s,1316610.0s,1327360.0s,1363730.0s,1570710.0s,1829830.0s,1854140.0s,...,674340.0s,713860.0s,8024410.0s,816210.0s,8802700.0s,899710.0s,9559530.0s,9713240.0s,9876140.0s,990520.0s
state,,,,,,,,,,,,,,,,,,,,,
Alabama,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
Alaska,0,0,0,0,0,0,0,0,0,0,...,0,total,0,0,0,0,0,0,0,0
Arizona,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
Arkansas,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
California,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
Colorado,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
Connecticut,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
Delaware,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,total,0,0,0,0
District of Columbia,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
Florida,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
Georgia,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,total,0,0
Hawaii,0,0,0,0,0,0,total,0,0,0,...,0,0,0,0,0,0,0,0,0,0
Idaho,0,0,0,0,0,0,0,total,0,0,...,0,0,0,0,0,0,0,0,0,0
Illinois,0,0,0,total,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
Indiana,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
Iowa,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
Kansas,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
Kentucky,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
Louisiana,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
Maine,0,0,0,0,0,total,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
Maryland,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
Massachusetts,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
Michigan,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,total,0
Minnesota,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
Mississippi,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
Missouri,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
Montana,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,total
Nebraska,0,0,0,0,0,0,0,0,total,0,...,0,0,0,0,0,0,0,0,0,0
Nevada,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
New Hampshire,0,0,0,0,total,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
New Jersey,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,total,0,0,0,0,0
New Mexico,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
New York,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
North Carolina,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,total,0,0,0
North Dakota,0,0,0,0,0,0,0,0,0,0,...,total,0,0,0,0,0,0,0,0,0
Ohio,0,total,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
Oklahoma,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
Oregon,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
Pennsylvania,0,0,total,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
Puerto Rico,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
Rhode Island,total,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
South Carolina,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
South Dakota,0,0,0,0,0,0,0,0,0,0,...,0,0,0,total,0,0,0,0,0,0
Tennessee,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
Texas,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
Utah,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
Vermont,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
Virginia,0,0,0,0,0,0,0,0,0,0,...,0,0,total,0,0,0,0,0,0,0
Washington,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
West Virginia,0,0,0,0,0,0,0,0,0,total,...,0,0,0,0,0,0,0,0,0,0
Wisconsin,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
Wyoming,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0